% il=1:9 9个光 3000b,4000b,5000b,6500b,3000d,4000d,5000d,6500d,dark
% ii=1:16 黄女亮,棕男亮,白男亮,黑女亮,黑男亮,白女亮,黄男亮,棕女亮,
%         黄女暗,棕男暗,白男暗,黑女暗,黑男暗,白女暗,黄男暗,棕女暗,
% iw=1:25 25个不同的白点
% io=1:30 被试人数

load('skin16lab.mat');

for ii=1:16
for il=1:9
    for io=1:30
    a=C((400*(il-1)+25*(ii-1)+1):(400*(il-1)+25*(ii-1)+25),io);
    n=sum(a==1);
    if n==0
    b(il,ii,io,1:3)=c(18,(ii*3-2):ii*3);
    else
    b1=c(:,(ii*3-2):ii*3);
    b(il,ii,io,1:3)=sum(a.*b1)./n;
    end
    end
    f(1:30,1:3)=b(il,ii,1:30,:);
    d(il,ii,1:3)=mean(f);
end
    e(1:9,(ii*3-2):(ii*3))=d(1:9,ii,1:3);
end

for i1=1:16
    g(1:9,(8*i1-7):(8*i1-5))=e(1:9,(i1*3-2):(i1*3));
    g(1:9,8*i1-4)=sqrt(e(1:9,(i1*3-1)).^2+e(1:9,i1*3).^2);
    g(1:9,8*i1-3)=atan(g(1:9,8*i1-5)./g(1:9,8*i1-6))./pi.*180;
    h(1:9,(i1*3-2):(i1*3))=lab2xyz(e(1:9,(i1*3-2):(i1*3)),'user',[433.800000000000,475,566.400000000000]);
    g(1:9,(8*i1-2):(8*i1))=xyz2uvY(h(1:9,(i1*3-2):(i1*3)));
    aa(1:9,(3*i1-2):3*i1)=xyz2uvY(h(1:9,(i1*3-2):(i1*3)));
end